l3chat/mk61ext/src/main.cpp
constexpr CpuFrequencyOption kCpuFrequencyOptions[] = {
    {12000000u, 432000000u, 6, 6, "12 MHz"},
    {24000000u, 432000000u, 6, 3, "24 MHz"},
    {48000000u, 1152000000u, 6, 4, "48 MHz"},
    {96000000u, 1152000000u, 6, 2, "96 MHz"},
    {125000000u, 1500000000u, 6, 2, "125 MHz"},
};

constexpr uint8_t kCpuFrequencyOptionCount =
    sizeof(kCpuFrequencyOptions) / sizeof(kCpuFrequencyOptions[0]);
constexpr uint8_t kDefaultCpuFrequencyIndex = kCpuFrequencyOptionCount - 1;
#else
constexpr uint8_t kDefaultCpuFrequencyIndex = 0;
#endif

struct KeypadDiagnostics {
  char lastKey = NO_KEY;
  KeyState lastState = IDLE;
  bool hasEvent = false;
  uint32_t lastEventMillis = 0;
};

struct HelpState {
  bool enabled = false;
  bool hasSelection = false;
  char key = NO_KEY;
  CalculatorPrefix prefix = CalculatorPrefix::None;
};

struct StoredSettings {
  uint32_t magic = kSettingsMagic;
  uint8_t version = kSettingsVersion;
  uint8_t angleMode = static_cast<uint8_t>(CalculatorAngleMode::Radians);
  uint8_t showStackLabels = 1;
  uint8_t backlightTimeoutIndex = kDefaultBacklightTimeoutIndex;
  uint8_t sleepTimeoutIndex = kDefaultSleepTimeoutIndex;
  uint8_t cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
  uint16_t brightness = 0;
  uint8_t reserved[7] = {};
};

struct SettingsState {
  bool active = false;
  StoredSettings originalSettings{};
  StoredSettings stagedSettings{};
  uint8_t selectedIndex = 0;
};

enum class PendingRegisterOperation : uint8_t {
  None,
  DirectRecall,
  DirectStore,
  IndirectRecall,
  IndirectStore,
};

enum class SettingsItem : uint8_t {
  Brightness = 0,
  BacklightTimeout = 1,
  SleepTimeout = 2,
  AngleMode = 3,
  StackLabels = 4,
  CpuFrequency = 5,
};

constexpr SettingsItem kSettingsItems[] = {
    SettingsItem::Brightness,
    SettingsItem::BacklightTimeout,
    SettingsItem::SleepTimeout,
    SettingsItem::AngleMode,
    SettingsItem::StackLabels,
    SettingsItem::CpuFrequency,
};

constexpr uint8_t kSettingsItemCount = sizeof(kSettingsItems) / sizeof(kSettingsItems[0]);

Keypad keypad(makeKeymap(kKeyMap), kRowPins, kColumnPins, kRowCount, kColumnCount);
TwoWire eepromWire(kEepromSdaPin, kEepromSclPin);
ExternalEEPROM eeprom;
RpnCalculator calculator;
ProgramVm programVm;
ProgramRecorder programRecorder;
ProgramRunner programRunner;
Mk61extDisplay display(
    U8G2_R0,
    kDisplayClockPin,
    kDisplayDataPin,
    kDisplayChipSelectPin,
    kDisplayDataCommandPin,
    kDisplayResetPin);

int brightness = 0;
bool showStackLevelNames = true;
bool eepromReady = false;
uint8_t backlightTimeoutIndex = kDefaultBacklightTimeoutIndex;
uint8_t sleepTimeoutIndex = kDefaultSleepTimeoutIndex;
uint8_t cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
bool backlightTimedOut = false;
bool displaySleeping = false;
uint32_t lastUserActivityMs = 0;
KeypadDiagnostics keypadDiagnostics;
HelpState helpState;
SettingsState settingsState;
PendingRegisterOperation pendingRegisterOperation = PendingRegisterOperation::None;
bool programMode = false;
uint8_t programEditAddress = 0;
float supplyVoltage = NAN;
uint32_t lastSupplySampleMs = 0;
bool runningOnBattery = true;

StoredSettings defaultStoredSettings() {
  StoredSettings settings{};
  settings.cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
  const uint32_t currentFrequencyHz = clock_get_hz(clk_sys);
  uint32_t bestDelta = UINT32_MAX;

  for (uint8_t index = 0; index < kCpuFrequencyOptionCount; ++index) {
    const uint32_t optionFrequencyHz = kCpuFrequencyOptions[index].frequencyHz;
    const uint32_t delta =
        (currentFrequencyHz > optionFrequencyHz) ? (currentFrequencyHz - optionFrequencyHz)
                                                 : (optionFrequencyHz - currentFrequencyHz);
    if (delta < bestDelta) {
      bestDelta = delta;
      settings.cpuFrequencyIndex = index;
    }
  }
#endif

  return settings;
}

uint8_t wrapOptionIndex(uint8_t currentIndex, uint8_t count, bool increase) {
  if (count == 0) {
    return 0;
  }

  if (increase) {
    return static_cast<uint8_t>((currentIndex + 1) % count);
  }

  return static_cast<uint8_t>((currentIndex + count - 1) % count);
}

const char *angleModeShortName(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return "RAD";
    case CalculatorAngleMode::Gradians:
      return "GRD";
    case CalculatorAngleMode::Degrees:
      return "DEG";
  }

  return "RAD";
}

CalculatorAngleMode nextAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Gradians;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Radians;
  }

  return CalculatorAngleMode::Radians;
}

CalculatorAngleMode previousAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Radians;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Gradians;
  }

  return CalculatorAngleMode::Radians;
}

uint32_t timeoutMilliseconds(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].milliseconds;
  }

  return kTimeoutOptions[index].milliseconds;
}

const char *timeoutLabel(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].label;
  }

  return kTimeoutOptions[index].label;
}

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
const char *cpuFrequencyLabel(uint8_t index) {
  if (index >= kCpuFrequencyOptionCount) {
    return kCpuFrequencyOptions[kDefaultCpuFrequencyIndex].label;
  }

  return kCpuFrequencyOptions[index].label;
}

bool applyCpuFrequencySetting(uint8_t index) {
  if (index >= kCpuFrequencyOptionCount) {
    return false;
  }

  const CpuFrequencyOption &option = kCpuFrequencyOptions[index];
  if (clock_get_hz(clk_sys) == option.frequencyHz) {
    cpuFrequencyIndex = index;
    SystemCoreClock = option.frequencyHz;
    return true;
  }

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
                  48 * MHZ,
                  48 * MHZ);

  pll_deinit(pll_sys);
  pll_init(pll_sys, 1, option.vcoHz, option.postDiv1, option.postDiv2);

  clock_configure(clk_ref,
                  CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC,
                  0,
                  XOSC_MHZ * MHZ,
                  XOSC_MHZ * MHZ);

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  clock_configure(clk_peri,
                  0,
                  CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  cpuFrequencyIndex = index;
  SystemCoreClock = option.frequencyHz;
  return clock_get_hz(clk_sys) == option.frequencyHz;
}
#else
const char *cpuFrequencyLabel(uint8_t) {
  return "FIXED";
}

bool applyCpuFrequencySetting(uint8_t index) {
  cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
  return index == kDefaultCpuFrequencyIndex;
}
#endif

