l3chat/mk61ext/src/main.cpp
void applyBrightness();
void updatePowerSourceState();

void noteUserActivity() {
  lastUserActivityMs = millis();
  backlightTimedOut = false;

  if (displaySleeping) {
    displaySleeping = false;
    display.setPowerSave(0);
  }

  applyBrightness();
}

bool isValidStoredSettings(const StoredSettings &settings) {
  if ((settings.magic != kSettingsMagic) || (settings.version != kSettingsVersion)) {
    return false;
  }

  if (settings.angleMode > static_cast<uint8_t>(CalculatorAngleMode::Degrees)) {
    return false;
  }

  if (settings.brightness > 256) {
    return false;
  }

  if (settings.backlightTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

  if (settings.sleepTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
  if (settings.cpuFrequencyIndex >= kCpuFrequencyOptionCount) {
    return false;
  }
#endif

  return true;
}

StoredSettings currentStoredSettings() {
  StoredSettings settings = defaultStoredSettings();
  settings.angleMode = static_cast<uint8_t>(calculator.angleMode());
  settings.showStackLabels = showStackLevelNames ? 1 : 0;
  settings.backlightTimeoutIndex = backlightTimeoutIndex;
  settings.sleepTimeoutIndex = sleepTimeoutIndex;
  settings.cpuFrequencyIndex = cpuFrequencyIndex;
  settings.brightness = static_cast<uint16_t>(brightness);
  return settings;
}

void applyBrightness() {
  if (displaySleeping || backlightTimedOut || (brightness <= 0)) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, HIGH);  // off
  } else if (brightness >= 256) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, LOW);  // on
  } else {
    analogWrite(kBacklightPin, 255 - brightness);
  }
}

void setupSupplySense() {
  analogReadResolution(kSupplyAdcResolutionBits);
}

float readSupplyVoltage() {
  uint32_t rawTotal = 0;

  // On the Pico board, A3/GPIO29 is tied to VSYS through a 1:3 divider.
  for (uint8_t sample = 0; sample < kSupplySampleCount; ++sample) {
    rawTotal += static_cast<uint32_t>(analogRead(kSupplySensePin));
  }

  const float rawAverage = static_cast<float>(rawTotal) / static_cast<float>(kSupplySampleCount);
  const float sensedVoltage = (rawAverage / static_cast<float>(kSupplyAdcMaxReading)) * kSupplyAdcReferenceVolts;
  return sensedVoltage * kSupplySenseDividerScale;
}

void updateSupplyVoltage(bool force = false) {
  const uint32_t now = millis();
  if (!force && std::isfinite(supplyVoltage) && ((now - lastSupplySampleMs) < kSupplyRefreshMs)) {
    return;
  }

  supplyVoltage = readSupplyVoltage();
  lastSupplySampleMs = now;
  updatePowerSourceState();
}

void formatSupplyVoltage(char *buffer, size_t bufferSize) {
  if (!std::isfinite(supplyVoltage)) {
    snprintf(buffer, bufferSize, "--.--V");
    return;
  }

  snprintf(buffer, bufferSize, "%.2fV", static_cast<double>(supplyVoltage));
}

void updatePowerSourceState() {
  if (!std::isfinite(supplyVoltage)) {
    return;
  }

  bool nextRunningOnBattery = runningOnBattery;
  if (runningOnBattery) {
    if (supplyVoltage >= kExternalPowerDetectOnVolts) {
      nextRunningOnBattery = false;
    }
  } else if (supplyVoltage <= kExternalPowerDetectOffVolts) {
    nextRunningOnBattery = true;
  }

  if (nextRunningOnBattery == runningOnBattery) {
    return;
  }

  runningOnBattery = nextRunningOnBattery;
  noteUserActivity();
}

void saveSettings(const StoredSettings &settings) {
  if (!eepromReady) {
    return;
  }

  (void)eeprom.putChanged(kSettingsEepromAddress, settings);
}

void applyStoredSettings(const StoredSettings &settings) {
  backlightTimeoutIndex = settings.backlightTimeoutIndex;
  sleepTimeoutIndex = settings.sleepTimeoutIndex;
  brightness = settings.brightness;
  showStackLevelNames = settings.showStackLabels != 0;
  calculator.setAngleMode(static_cast<CalculatorAngleMode>(settings.angleMode));
  if (!applyCpuFrequencySetting(settings.cpuFrequencyIndex)) {
    (void)applyCpuFrequencySetting(kDefaultCpuFrequencyIndex);
  }

  noteUserActivity();
}

void loadSettings() {
  StoredSettings settings;
  eeprom.get(kSettingsEepromAddress, settings);

  if (!isValidStoredSettings(settings)) {
    settings = defaultStoredSettings();
    applyStoredSettings(settings);
    saveSettings(settings);
    return;
  }

  applyStoredSettings(settings);
}

uint16_t increaseBrightnessValue(uint16_t value) {
  uint16_t updated = static_cast<uint16_t>(value * 2);
  if (updated > 256) {
    updated = 256;
  }
  if (updated == 0) {
    updated = 1;
  }
  return updated;
}

uint16_t decreaseBrightnessValue(uint16_t value) {
  return static_cast<uint16_t>(value / 2);
}

const char *settingsItemName(SettingsItem item) {
  switch (item) {
    case SettingsItem::Brightness:
      return "Brightness";
    case SettingsItem::BacklightTimeout:
      return "Backlight";
    case SettingsItem::SleepTimeout:
      return "Sleep";
    case SettingsItem::AngleMode:
      return "Angle";
    case SettingsItem::StackLabels:
      return "Labels";
    case SettingsItem::CpuFrequency:
      return "CPU freq";
  }

  return "";
}

void formatBrightnessSetting(char *buffer, size_t bufferSize, uint16_t value) {
  if (value == 0) {
    snprintf(buffer, bufferSize, "OFF");
    return;
  }

  snprintf(buffer, bufferSize, "%u", static_cast<unsigned>(value));
}

const char *stackLabelsSettingName(uint8_t showStackLabels) {
  return showStackLabels != 0 ? "ON" : "OFF";
}

void formatSettingValue(SettingsItem item,
                        const StoredSettings &settings,
                        char *buffer,
                        size_t bufferSize) {
  switch (item) {
    case SettingsItem::Brightness:
      formatBrightnessSetting(buffer, bufferSize, settings.brightness);
      return;
    case SettingsItem::BacklightTimeout:
      snprintf(buffer, bufferSize, "%s", timeoutLabel(settings.backlightTimeoutIndex));
      return;
    case SettingsItem::SleepTimeout:
      snprintf(buffer, bufferSize, "%s", timeoutLabel(settings.sleepTimeoutIndex));
      return;
    case SettingsItem::AngleMode:
      snprintf(buffer,
               bufferSize,
               "%s",
               angleModeShortName(static_cast<CalculatorAngleMode>(settings.angleMode)));
      return;
    case SettingsItem::StackLabels:
      snprintf(buffer, bufferSize, "%s", stackLabelsSettingName(settings.showStackLabels));
      return;
    case SettingsItem::CpuFrequency:
      snprintf(buffer, bufferSize, "%s", cpuFrequencyLabel(settings.cpuFrequencyIndex));
      return;
  }

  buffer[0] = '\0';
}

const char *settingsItemDescription(SettingsItem item) {
  switch (item) {
    case SettingsItem::Brightness:
      return "Set the display backlight level.";
    case SettingsItem::BacklightTimeout:
      return "Switch off the backlight after inactivity on battery.";
    case SettingsItem::SleepTimeout:
      return "Put the system into energy-saving mode after inactivity on battery.";
    case SettingsItem::AngleMode:
      return "Choose RAD, GRD, or DEG.";
    case SettingsItem::StackLabels:
      return "Show or hide the T Z Y X labels.";
    case SettingsItem::CpuFrequency:
      return "Select the RP2040 system clock frequency.";
  }

