l3chat/mk61ext/src/main.cpp
  if ((prefix == CalculatorPrefix::None) && (keyPressed == 'r')) {
    armPendingRegisterOperation(PendingRegisterOperation::DirectStore);
    return true;
  }

  if ((prefix == CalculatorPrefix::K) && (keyPressed == 'q')) {
    armPendingRegisterOperation(PendingRegisterOperation::IndirectRecall);
    return true;
  }

  if ((prefix == CalculatorPrefix::K) && (keyPressed == 'r')) {
    armPendingRegisterOperation(PendingRegisterOperation::IndirectStore);
    return true;
  }

  if (pendingRegisterOperation == PendingRegisterOperation::None) {
    return false;
  }

  const PendingRegisterOperation operation = pendingRegisterOperation;
  clearPendingRegisterOperation();

  uint8_t registerIndex = 0;
  if (!decodeRegisterKey(keyPressed, registerIndex)) {
    return true;
  }

  switch (operation) {
    case PendingRegisterOperation::DirectRecall:
      (void)calculator.recallRegister(registerIndex);
      return true;
    case PendingRegisterOperation::DirectStore:
      (void)calculator.storeRegister(registerIndex);
      return true;
    case PendingRegisterOperation::IndirectRecall:
      (void)calculator.recallIndirectRegister(registerIndex);
      return true;
    case PendingRegisterOperation::IndirectStore:
      (void)calculator.storeIndirectRegister(registerIndex);
      return true;
    case PendingRegisterOperation::None:
      return false;
  }

  return false;
}

void handleSettingsPressedKey(char keyPressed) {
  switch (keyPressed) {
    case 'a':
      selectPreviousSettingsItem();
      return;
    case 'b':
      selectNextSettingsItem();
      return;
    case 'c':
      adjustSelectedSetting(false);
      return;
    case 'd':
      adjustSelectedSetting(true);
      return;
    case 'e':
      exitSettingsMode();
      return;
    case 'f':
      cancelSettingsMode();
      return;
    default:
      return;
  }
}

void handleProgramPressedKey(char keyPressed) {
  if ((keyPressed == 'x') && !programRecorder.hasPendingOperand() &&
      (std::strcmp(programRecorder.activePrefixName(), "F") == 0)) {
    exitProgramMode();
    return;
  }

  (void)programRecorder.handleKey(programVm, programEditAddress, keyPressed);
}

void handlePressedKey(char keyPressed) {
  const bool runControlContext =
      (pendingRegisterOperation == PendingRegisterOperation::None) &&
      (activeCalculatorPrefix() == CalculatorPrefix::None);

  if (settingsState.active) {
    handleSettingsPressedKey(keyPressed);
    return;
  }

  if (programRunner.isRunning()) {
    if (runControlContext && (keyPressed == 'o')) {
      programRunner.stop();
    }
    return;
  }

  if (keyPressed == 'f') {
    toggleHelpMode();
    return;
  }

  if (helpState.enabled) {
    handleHelpPressedKey(keyPressed);
    return;
  }

  if (programMode) {
    handleProgramPressedKey(keyPressed);
    return;
  }

  if ((activeCalculatorPrefix() == CalculatorPrefix::F) && (keyPressed == 'y')) {
    enterProgramMode();
    return;
  }

  if (keyPressed == 'e') {
    enterSettingsMode();
    return;
  }

  if (runControlContext && (keyPressed == 'o')) {
    (void)programRunner.start(programVm);
    return;
  }

  if (runControlContext && (keyPressed == 'n')) {
    programRunner.resetRunAddress();
    return;
  }

  programRunner.clearError();

  if (handleRegisterOperationKey(keyPressed)) {
    return;
  }

  calculator.apply(translateKeyToCalculatorAction(keyPressed));
}

const char *keyStateName(KeyState state) {
  switch (state) {
    case IDLE:
      return "IDLE";
    case PRESSED:
      return "PRESS";
    case HOLD:
      return "HOLD";
    case RELEASED:
      return "REL";
  }

  return "?";
}

void updateInput() {
  const bool keyActivity = keypad.getKeys();

  for (byte index = 0; index < keypad.numKeys(); index++) {
    const Key &key = keypad.key[index];

    if (!keyActivity) {
      continue;
    }

    if (key.stateChanged) {
      keypadDiagnostics.lastKey = key.kchar;
      keypadDiagnostics.lastState = key.kstate;
      keypadDiagnostics.hasEvent = true;
      keypadDiagnostics.lastEventMillis = millis();

      if (key.kstate == PRESSED) {
        const bool wasSleeping = displaySleeping;
        noteUserActivity();
        if (wasSleeping) {
          continue;
        }

        handlePressedKey(key.kchar);
      }
    }
  }
}

void updateProgramExecution() {
  if (!programRunner.isRunning()) {
    return;
  }

  for (uint8_t step = 0; step < kProgramRunStepsPerLoop; ++step) {
    if (!programRunner.isRunning()) {
      break;
    }

    (void)programRunner.step(programVm, calculator);
  }

  lastUserActivityMs = millis();
}

void updateIdlePowerState() {
  if (settingsState.active) {
    return;
  }

  if (programRunner.isRunning()) {
    return;
  }

  if (!runningOnBattery) {
    return;
  }

  const uint32_t idleMs = millis() - lastUserActivityMs;
  const uint32_t sleepTimeoutMs = timeoutMilliseconds(sleepTimeoutIndex);
  if (!displaySleeping && (sleepTimeoutMs > 0) && (idleMs >= sleepTimeoutMs)) {
    displaySleeping = true;
    backlightTimedOut = true;
    display.setPowerSave(1);
    applyBrightness();
    return;
  }

  const uint32_t backlightTimeoutMs = timeoutMilliseconds(backlightTimeoutIndex);
  if (!displaySleeping && !backlightTimedOut && (backlightTimeoutMs > 0) &&
      (idleMs >= backlightTimeoutMs)) {
    backlightTimedOut = true;
    applyBrightness();
  }
}

void formatStackValue(CalculatorValue value, char *buffer, size_t bufferSize, int precision) {
  const CalculatorValue normalizedValue = (std::fabs(value) < 1e-12) ? 0.0 : value;
  snprintf(buffer, bufferSize, "%.*g", precision, normalizedValue);
}

void drawRightAlignedText(int rightEdge, int y, const char *text) {
  display.drawStr(rightEdge - display.getStrWidth(text), y, text);
}

void formatStackValueToFit(CalculatorValue value,
                           char *buffer,
                           size_t bufferSize,
                           int maxPixelWidth) {
  for (int precision = kStackValueMaxPrecision; precision >= 1; --precision) {
    formatStackValue(value, buffer, bufferSize, precision);
    if (display.getStrWidth(buffer) <= maxPixelWidth) {
      return;
    }
  }

  formatStackValue(value, buffer, bufferSize, 1);
}

