l3chat/mk61ext/src/main.cpp
  for (uint8_t line = 0; line < maxLines; ++line) {
    while (text[position] == ' ') {
      ++position;
    }

    if (text[position] == '\0') {
      return;
    }

    const size_t lineStart = position;
    size_t lineEnd = lineStart;
    size_t lastSpace = static_cast<size_t>(-1);
    size_t lastFittingEnd = lineStart;

    while ((text[position] != '\0') && (text[position] != '\n')) {
      if (text[position] == ' ') {
        lastSpace = position;
      }

      const size_t nextLength = (position - lineStart) + 1;
      if (nextLength >= sizeof(lineBuffer)) {
        break;
      }

      std::memcpy(lineBuffer, text + lineStart, nextLength);
      lineBuffer[nextLength] = '\0';
      if (display.getStrWidth(lineBuffer) > maxPixelWidth) {
        break;
      }

      lastFittingEnd = position + 1;
      ++position;
    }

    if (text[position] == '\n') {
      lineEnd = position;
      ++position;
    } else if (text[position] == '\0') {
      lineEnd = position;
    } else if ((lastSpace != static_cast<size_t>(-1)) && (lastSpace >= lineStart) && (lastSpace < lastFittingEnd)) {
      lineEnd = lastSpace;
      position = lastSpace + 1;
    } else if (lastFittingEnd > lineStart) {
      lineEnd = lastFittingEnd;
      position = lastFittingEnd;
    } else {
      lineEnd = position + 1;
      ++position;
    }

    size_t lineLength = lineEnd - lineStart;
    if (lineLength >= sizeof(lineBuffer)) {
      lineLength = sizeof(lineBuffer) - 1;
    }

    std::memcpy(lineBuffer, text + lineStart, lineLength);
    lineBuffer[lineLength] = '\0';
    display.drawStr(x, y + (line * lineHeight), lineBuffer);
  }
}

void formatHelpTitle(char *buffer, size_t bufferSize) {
  if (!helpState.hasSelection) {
    snprintf(buffer, bufferSize, "Help mode");
    return;
  }

  const char *label = calculatorKeyHelpLabel(helpState.key, helpState.prefix);
  const char *prefixName = (helpState.prefix == CalculatorPrefix::F)
                               ? "F"
                               : (helpState.prefix == CalculatorPrefix::K) ? "K" : "";

  if (prefixName[0] != '\0') {
    snprintf(buffer, bufferSize, "%s %c: %s", prefixName, helpState.key, label);
  } else {
    snprintf(buffer, bufferSize, "%c: %s", helpState.key, label);
  }
}

const char *currentHelpDescription() {
  if (!helpState.hasSelection) {
    return "Press any key to see its meaning. Use k or p first to inspect F or K shifts. Press f again to leave help.";
  }

  return calculatorKeyHelpDescription(helpState.key, helpState.prefix);
}

void drawHelpScreen() {
  char titleBuffer[32];

  drawStatusBar();
  formatHelpTitle(titleBuffer, sizeof(titleBuffer));

  display.setFont(u8g2_font_5x7_mr);
  display.drawStr(0, kHelpTitleY, titleBuffer);

  display.setFont(u8g2_font_5x7_mr);
  drawWrappedText(
      0, kHelpBodyY, currentHelpDescription(), kHelpTextWidth, kHelpBodyLineCount, kHelpLineHeight);
}

void drawSettingsRow(int y, bool selected, uint8_t index, const char *label, const char *value) {
  char leftBuffer[32];

  if (selected) {
    display.drawBox(0, y, kSettingsCursorBoxWidth, 7);
    display.setDrawColor(0);
    display.drawStr(1, y, ">");
    display.setDrawColor(1);
  }

  snprintf(leftBuffer, sizeof(leftBuffer), "%u. %s", static_cast<unsigned>(index + 1), label);
  display.drawStr(kSettingsCursorBoxWidth + 2, y, leftBuffer);
  drawRightAlignedText(kDisplayWidth - 1, y, value);
}

void drawSettingsScreen() {
  char valueBuffer[16];

  drawStatusBar();
  display.setFont(u8g2_font_5x7_mr);
  for (uint8_t index = 0; index < kSettingsItemCount; ++index) {
    const SettingsItem item = kSettingsItems[index];
    formatSettingValue(item, settingsState.stagedSettings, valueBuffer, sizeof(valueBuffer));
    drawSettingsRow(kSettingsFirstRowY + (index * kSettingsRowHeight),
                    settingsState.selectedIndex == index,
                    index,
                    settingsItemName(item),
                    valueBuffer);
  }

  display.setFont(u8g2_font_4x6_mr);
  drawWrappedText(0,
                  kSettingsDescriptionY,
                  settingsItemDescription(kSettingsItems[settingsState.selectedIndex]),
                  kHelpTextWidth,
                  kSettingsDescriptionLineCount,
                  kSettingsDescriptionLineHeight);
}

void drawProgramScreen() {
  std::array<uint16_t, ProgramVm::kProgramCapacity + 1> listingAddresses{};
  uint16_t listingCount = 0;
  uint16_t cursor = 0;
  const uint16_t programLength = programVm.programLength();

  normalizeProgramEditAddress();
  cursor = 0;

  while ((cursor < programLength) && (listingCount < ProgramVm::kProgramCapacity)) {
    listingAddresses[listingCount++] = cursor;

    const ProgramVm::DecodedStep step = programVm.decodeAt(static_cast<uint8_t>(cursor));
    const uint16_t stepWidth = (step.width > 0) ? step.width : 1;
    const uint16_t next = cursor + stepWidth;
    if ((next <= cursor) || (next > programLength)) {
      cursor = programLength;
    } else {
      cursor = next;
    }
  }

  listingAddresses[listingCount++] = programLength;

  uint16_t cursorIndex = listingCount - 1;
  for (uint16_t index = 0; index < listingCount; ++index) {
    if (listingAddresses[index] == static_cast<uint16_t>(programEditAddress)) {
      cursorIndex = index;
      break;
    }
  }

  uint16_t firstVisible = 0;
  if (listingCount > static_cast<uint16_t>(kProgramListVisibleRows)) {
    const uint16_t halfWindow = static_cast<uint16_t>(kProgramListVisibleRows / 2);
    if (cursorIndex > halfWindow) {
      firstVisible = cursorIndex - halfWindow;
    }

    const uint16_t maxFirstVisible = listingCount - kProgramListVisibleRows;
    if (firstVisible > maxFirstVisible) {
      firstVisible = maxFirstVisible;
    }
  }

  drawStatusBar();

  display.setFont(u8g2_font_5x7_mr);
  for (uint8_t row = 0; row < kProgramListVisibleRows; ++row) {
    const uint16_t lineIndex = firstVisible + row;
    if (lineIndex >= listingCount) {
      break;
    }

    const uint16_t lineAddress = listingAddresses[lineIndex];
    const bool isCursorLine = lineAddress == static_cast<uint16_t>(programEditAddress);

    char listingBuffer[64];
    if (lineAddress == programLength) {
      snprintf(listingBuffer, sizeof(listingBuffer), "%02X: --      END", static_cast<unsigned>(lineAddress));
    } else if (!programVm.formatListingLine(static_cast<uint8_t>(lineAddress),
                                            listingBuffer,
                                            sizeof(listingBuffer))) {
      snprintf(listingBuffer, sizeof(listingBuffer), "%02X: --      END", static_cast<unsigned>(lineAddress));
    }

    char rowBuffer[72];
    snprintf(rowBuffer, sizeof(rowBuffer), "%c%s", isCursorLine ? '>' : ' ', listingBuffer);
    display.drawStr(0, kProgramListFirstY + (row * kProgramListRowHeight), rowBuffer);
  }
}

void drawCalculatorScreen() {
  const CalculatorStack stack = calculator.stack();
  char xBuffer[RpnCalculator::kEntryBufferSize];
  const char *tLabel = showStackLevelNames ? "T:" : "";
  const char *zLabel = showStackLevelNames ? "Z:" : "";
  const char *yLabel = showStackLevelNames ? "Y:" : "";

  drawStatusBar();

  drawStackLine(kStackFirstY + (0 * kStackRowHeight), tLabel, stack.t);
  drawStackLine(kStackFirstY + (1 * kStackRowHeight), zLabel, stack.z);
  drawStackLine(kStackFirstY + (2 * kStackRowHeight), yLabel, stack.y);
  display.setFont(u8g2_font_6x10_mr);
  const char *xLabel = showStackLevelNames ? (calculator.isEntering() ? "X>" : "X:") : "";
  const int labelWidth = (xLabel[0] != '\0') ? display.getStrWidth(xLabel) : 0;
  const int gap = (labelWidth > 0) ? kStackValueMinGap : 0;
  const int maxValueWidth = kDisplayWidth - labelWidth - gap;
  formatXDisplayToFit(xBuffer, sizeof(xBuffer), maxValueWidth);
  drawStackTextLine(kStackFirstY + (3 * kStackRowHeight), xLabel, xBuffer);
}

}  // namespace

void setup() {
  setupDisplay();
  setupSupplySense();

  display.clearBuffer();
  setupEeprom();
  loadSettings();
  updateSupplyVoltage(true);
  display.sendBuffer();
  delay(3000);
  calculator.seedRandom(static_cast<uint32_t>(micros()) ^ 0xA5A55A5Au);
}

void loop() {
  display.clearBuffer();
  updateInput();
  updateProgramExecution();
  updateSupplyVoltage();
  updateIdlePowerState();
  if (settingsState.active) {
    drawSettingsScreen();
  } else if (helpState.enabled) {
    drawHelpScreen();
  } else if (programMode) {
    drawProgramScreen();
  } else {
    drawCalculatorScreen();
  }

  display.sendBuffer();
  delay(displaySleeping ? kSleepLoopDelayMs : kLoopDelayMs);
}
